Tekla Open API Reference for Tekla Structures 2025
CustomPart.GetBooleans Method
 Returns an enumerator of all the connected boolean objects.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModelObjectEnumerator GetBooleans()
Public Function GetBooleans As ModelObjectEnumerator
Return Value
Type: ModelObjectEnumerator
A model object enumerator on success, otherwise null.
See Also
Reference
CustomPart Class
Tekla.Structures.Model Namespace